# Задача 3:Сложная задача: По желанию
# адача: НОП (наибольшая общая подпоследовательность) двух строк — это самая длинная последовательность 
# символов, которая содержится и в первой, и во второй строке, в том же порядке, но не обязательно подряд. 
# Другими словами, это максимально длинная последовательность символов, которая является "общей" для обеих строк.
# __
# Пример:

# makefile
# Copy code
# X = "AGGTAB"
# Y = "GXTXAYB"
# Наибольшая общая подпоследовательность: "GTAB" (другие НОП также могут быть "GTTAB" и "GTXAB").

# Задача состоит в том, чтобы написать программу, которая находит НОП для двух заданных строк.


