// Задача 19

// Напишите программу, которая принимает на вход пятизначное число и проверяет, является ли оно палиндромом. Через строку решать нельзя.

// 14212 -> нет

// 12821 -> да

// 23432 -> да


Console.Clear();
System.Console.Write("Введите пятизначное число: ");
int num = Convert.ToInt32(Console.ReadLine());
int i = 0;
while (i<6)
{
    if (num%10000)
        {
            
        }
}
    









// string[] str = Console.ReadLine().Split(";");

// int[] num1 = new int[str.Length];

// for (int i = 0; i < str.Length; i++)
// {
//   num1[i] = Convert.ToInt32(str[i]);
// }

// System.Console.WriteLine(str.Length);

// int[] num2 = new int[]{1, 2, 3, 4, 5};
// var n = num2[1];
// System.Console.WriteLine(n);